Repository: PropheticBird/em
Catalog: em/locale/*/LC_MESSAGES/em.po
Languages: ru

source: %(prog)s program is a terminal tool that prints FILE(s), or standard input to standard output and highlights the expressions that are matched the PATTERN.
ru: %(prog)s - это программа для терминала, которая печатает файл(ы), или стандартный поток ввода на стандартный поток вывода, а также подсвечивает выражения, которые удовлетворяют некоторому входному шаблону.

source: With no FILE, or when FILE is -, read standard input. The FORMAT option must be one of: BOLD, UNDERLINE, GREY, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN or WHITE.
ru: Читать стандартный поток ввода, если FILE не указан или указан как -. Параметр FORMAT может принимать следующие значения: BOLD, UNDERLINE, GREY, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN и WHITE.

source: a pattern to highlight
ru: шаблон для поиска

source: a color to highlight matched expressions
ru: цвет/стиль выделения

source: search for pattern in these file(s)
ru: искать шаблон в этих файлах

source: ignore case distinctions
ru: игнорировать регистр при поиске

source: highlight entire line
ru: выделять всю строку

source: highlight only when stdout refers to tty
ru: выделять, если stdout связан с терминалом

source: show program's version number and exit
ru: показать информацию о версии и выйти

source: show this help message and exit
ru: показать эту справку и выйти

source: Unknown format value
ru: Неизвестное значение параметра FORMAT
